Script started on Wed 19 Feb 2014 05:20:15 PM PST
You are currently using 0% (307.0 KiB) of your 488.3 MiB quota.
]0;vispatel@unix2:lab5[vispatel@unix2 lab5]$ mk list2.c
CSOURCE=list2.c EXECBIN=list2
+ cid + list2.c
+ checksource list2.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list2.c -o list2 -lm
list2.c: In function â€˜mainâ€™:
list2.c:13:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
+ set +x
============================================================
]0;vispatel@unix2:lab5[vispatel@unix2 lab5]$ valgrind list2 foo bar
==12398== Memcheck, a memory error detector
==12398== Copyright (C) 2002-2012, and GNU GPL'd, by Julian Seward et al.
==12398== Using Valgrind-3.8.1 and LibVEX; rerun with -h for copyright info
==12398== Command: list2 foo bar
==12398== 
0x4c28180->node {word=0x7ff000221->[USER=vispatel], link=0x4c28130}
0x4c28130->node {word=(nil)->[(null)], link=0x4c280e0}
0x4c280e0->node {word=0x7ff00021d->[bar], link=0x4c28090}
0x4c28090->node {word=0x7ff000219->[foo], link=0x4c28040}
==12398== Conditional jump or move depends on uninitialised value(s)
==12398==    at 0x400682: main (list2.c:22)
==12398== 
==12398== 
==12398== HEAP SUMMARY:
==12398==     in use at exit: 80 bytes in 5 blocks
==12398==   total heap usage: 5 allocs, 0 frees, 80 bytes allocated
==12398== 
==12398== LEAK SUMMARY:
==12398==    definitely lost: 16 bytes in 1 blocks
==12398==    indirectly lost: 64 bytes in 4 blocks
==12398==      possibly lost: 0 bytes in 0 blocks
==12398==    still reachable: 0 bytes in 0 blocks
==12398==         suppressed: 0 bytes in 0 blocks
==12398== Rerun with --leak-check=full to see details of leaked memory
==12398== 
==12398== For counts of detected and suppressed errors, rerun with: -v
==12398== Use --track-origins=yes to see where uninitialised values come from
==12398== ERROR SUMMARY: 1 errors from 1 contexts (suppressed: 6 from 6)
]0;vispatel@unix2:lab5[vispatel@unix2 lab5]$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.6-34.el6)
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/j/vispatel/private/cmps012b/lab5/list2...done.
(gdb) break [K[K[K[K[K[Klist
6	
7	typedef struct node node;
8	struct node {
9	   char *word;
10	   node *link;
11	};
12	
13	int main (int argc, char **argv) {
14	   node *head;
15	   for (int argi = 0; argi < 5; ++argi) {
(gdb) next
The program is not being run.
(gdb) list
16	      node *node = malloc (sizeof (struct node));
17	      assert (node != NULL);
18	      node->word = argv[argi];
19	      node->link = head;
20	      head = node;
21	   }
22	   for (node *curr = head; curr->link != NULL; curr = curr->link) {
23	      printf ("%p->node {word=%p->[%s], link=%p}\n",
24	              curr, curr->word, curr->word, curr->link);
25	   }
(gdb) list
26	   return 9;
27	}
(gdb) break 26
Breakpoint 1 at 0x400684: file list2.c, line 26.
(gdb) run foo bar
Starting program: /afs/cats.ucsc.edu/users/j/vispatel/private/cmps012b/lab5/list2 foo bar
warning: Skipping deprecated .gdb_index section in /usr/lib/debug/lib64/ld-2.12.so.debug.
Do "set use-deprecated-index-sections on" before the file is read
to use the section anyway.
0x601090->node {word=0x7fffffffe0bd->[USER=vispatel], link=0x601070}
0x601070->node {word=(nil)->[(null)], link=0x601050}
0x601050->node {word=0x7fffffffe0b9->[bar], link=0x601030}
0x601030->node {word=0x7fffffffe0b5->[foo], link=0x601010}

Breakpoint 1, main (argc=3, argv=0x7fffffffdda8) at list2.c:26
26	   return 9;
(gdb) where
#0  main (argc=3, argv=0x7fffffffdda8) at list2.c:26
(gdb) list
21	   }
22	   for (node *curr = head; curr->link != NULL; curr = curr->link) {
23	      printf ("%p->node {word=%p->[%s], link=%p}\n",
24	              curr, curr->word, curr->word, curr->link);
25	   }
26	   return 9;
27	}
(gdb) list list2.c:23
18	      node->word = argv[argi];
19	      node->link = head;
20	      head = node;
21	   }
22	   for (node *curr = head; curr->link != NULL; curr = curr->link) {
23	      printf ("%p->node {word=%p->[%s], link=%p}\n",
24	              curr, curr->word, curr->word, curr->link);
25	   }
26	   return 9;
27	}
(gdb) print head
$1 = (node *) 0x601090
(gdb) bt
#0  main (argc=3, argv=0x7fffffffdda8) at list2.c:26
(gdb) up
Initial frame selected; you cannot go up.
(gdb) up
Initial frame selected; you cannot go up.
(gdb) up
Initial frame selected; you cannot go up.
(gdb) print head
$2 = (node *) 0x601090
(gdb) print *head
$3 = {word = 0x7fffffffe0bd "USER=vispatel", link = 0x601070}
(gdb) print *(head->word)
$4 = 85 'U'
(gdb) print head->link->link->link
$5 = (node *) 0x601030
(gdb) print *(head->->[K[Klink->link->link)
$6 = {word = 0x7fffffffe0b5 "foo", link = 0x601010}
(gdb) quit
A debugging session is active.

	Inferior 1 [process 12935] will be killed.

Quit anyway? (y or n) y
]0;vispatel@unix2:lab5[vispatel@unix2 lab5]$ exit
exit

Script done on Wed 19 Feb 2014 05:24:19 PM PST
