Script started on Wed 19 Feb 2014 05:24:37 PM PST
You are currently using 0% (313.0 KiB) of your 488.3 MiB quota.
]0;vispatel@unix2:lab5[vispatel@unix2 lab5]$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.6-34.el6)
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/j/vispatel/private/cmps012b/lab5/list2...done.
(gdb) break main
Breakpoint 1 at 0x4005bf: file list2.c, line 15.
(gdb) run foo bar
Starting program: /afs/cats.ucsc.edu/users/j/vispatel/private/cmps012b/lab5/list2 foo bar
warning: Skipping deprecated .gdb_index section in /usr/lib/debug/lib64/ld-2.12.so.debug.
Do "set use-deprecated-index-sections on" before the file is read
to use the section anyway.

Breakpoint 1, main (argc=3, argv=0x7fffffffdda8) at list2.c:15
15	   for (int argi = 0; argi < 5; ++argi) {
(gdb) print argc [K
$1 = 3
(gdb) argv
Undefined command: "argv".  Try "help".
(gdb) print argv
$2 = (char **) 0x7fffffffdda8
(gdb) print argv[0]
$3 = 0x7fffffffe075 "/afs/cats.ucsc.edu/users/j/vispatel/private/cmps012b/lab5/list2"
(gdb) print argv[1]
$4 = 0x7fffffffe0b5 "foo"
(gdb) print argv[1][1P]2]
$5 = 0x7fffffffe0b9 "bar"
(gdb) print argv[2][1P]3]
$6 = 0x0
(gdb) print argv[3][1P]4]
$7 = 0x7fffffffe0bd "USER=vispatel"
(gdb) env
Undefined command: "env".  Try "help".
(gdb) print [Kenv
Undefined command: "printenv".  Try "help".
(gdb) print argv[5]
$8 = 0x7fffffffe0cb "LOGNAME=vispatel"
(gdb) print argv[5][1P]6]
$9 = 0x7fffffffe0dc "HOME=/afs/cats.ucsc.edu/users/j/vispatel"
(gdb) e[Kquit
A debugging session is active.

	Inferior 1 [process 13591] will be killed.

Quit anyway? (y or n) y
]0;vispatel@unix2:lab5[vispatel@unix2 lab5]$ exit
exit

Script done on Wed 19 Feb 2014 05:26:18 PM PST
